Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.sidebar.error.selectRequiresName
source: sidebar select requires one sidebar name
ar: يتطلب تحديد الشريط الجانبي اسم شريط جانبي واحد
de: sidebar select erfordert einen Seitenleistennamen
es: sidebar select requiere un nombre de barra lateral
fr: sidebar select requiert un nom de barre latérale
ja: sidebar select にはサイドバー名が 1 つ必要です
ko: sidebar select는 하나의 사이드바 이름이 필요합니다
zh_hans: sidebar select 需要一个 sidebar 名称
zh_hant: sidebar select 需要一個側邊欄名稱

# cli.sidebar.error.unexpectedArguments
source: sidebar %@ accepts at most one sidebar name
ar: يقبل الشريط الجانبي %@ اسم شريط جانبي واحد على الأكثر
de: sidebar %@ akzeptiert höchstens einen Seitenleisten-Namen
es: sidebar %@ acepta como máximo un nombre de barra lateral
fr: sidebar %@ accepte au plus un nom de barre latérale
ja: sidebar %@ に指定できるサイドバー名は 1 つまでです
ko: sidebar %@은(는) 최대 하나의 사이드바 이름만 허용합니다
zh_hans: sidebar %@ 最多接受一个 sidebar 名称
zh_hant: sidebar %@ 最多僅接受一個側邊欄名稱

# cli.sidebar.error.unknownCommand
source: Unknown sidebar command '%@'
ar: أمر شريط جانبي غير معروف '%@'
de: Unbekannter sidebar-Befehl „%@“
es: Comando de sidebar desconocido '%@'
fr: Commande sidebar inconnue '%@'
ja: 不明な sidebar コマンド '%@'
ko: 알 수 없는 사이드바 명령어 '%@'
zh_hans: 未知的 sidebar 命令 '%@'
zh_hant: 未知的 sidebar 指令 '%@'

# cli.sidebar.noSidebars
source: No custom sidebars found.
ar: لم يتم العثور على أشرطة جانبية مخصصة.
de: Keine benutzerdefinierten Seitenleisten gefunden.
es: No se encontraron barras laterales personalizadas.
fr: Aucune barre latérale personnalisée trouvée.
ja: カスタムサイドバーが見つかりません。
ko: 사용자 정의 사이드바를 찾을 수 없습니다.
zh_hans: 未找到自定义侧边栏。
zh_hant: 找不到自訂側邊欄。

# cli.sidebar.report.error
source: ERROR %@ [%@] %@: %@
ar: خطأ %@ [%@] %@: %@
de: FEHLER %@ [%@] %@: %@
fr: ERREUR %@ [%@] %@ : %@
ja: エラー %@ [%@] %@: %@
ko: 오류 %@ [%@] %@: %@
zh_hant: 錯誤 %@ [%@] %@：%@

# cli.sidebar.report.ok
source: OK %@ [%@] %@
ar: موافق %@ [%@] %@
ko: 정상 %@ [%@] %@

# cli.sidebar.report.opened
source: Opened %@ as pane %@.
ar: تم فتح %@ كجزء %@.
de: %@ als Teilfenster %@ geöffnet.
es: Se abrió %@ como el panel %@.
fr: %@ ouvert en tant que volet %@.
ja: %@ をペイン %@ として開きました。
ko: %@을(를) 분할 창 %@(으)로 열었습니다.
zh_hans: 已将 %@ 作为窗格 %@ 打开。
zh_hant: 已將 %@ 開啟為窗格 %@。

# cli.sidebar.report.reloadSummary
source: Reloaded %d valid sidebars. %d valid, %d invalid.
ar: تم إعادة تحميل %d شريط جانبي صالح. %d شريط جانبي صالح، و%d شريط جانبي غير صالح.
de: %d gültige Seitenleisten neu geladen. %d gültige, %d ungültige.
es: Se recargaron %d barras laterales válidas. %d válidas, %d inválidas.
fr: Rechargé %d barres latérales valides. %d valides, %d invalides.
ja: %d個の有効なサイドバーを再読み込みしました。有効%d個、無効%d個。
ko: 유효한 사이드바 %d개를 다시 로드했습니다. 유효 %d개, 유효하지 않음 %d개.
zh_hans: 已重新加载 %d 个有效侧边栏。%d 个有效，%d 个无效。
zh_hant: 已重新載入 %d 個有效的側邊欄。%d 個有效，%d 個無效。

# cli.sidebar.report.selected
source: Selected %@.
ar: تم تحديد %@.
de: %@ ausgewählt.
es: Se seleccionó %@.
fr: %@ sélectionné.
ja: %@ を選択しました。
ko: %@을(를) 선택했습니다.
zh_hans: 已选择 %@。
zh_hant: 已選取 %@。

# cli.sidebar.report.summary
source: %d valid, %d invalid.
ar: %d شريط جانبي صالح، و%d شريط جانبي غير صالح.
de: %d gültige, %d ungültige.
es: %d válidas, %d inválidas.
fr: %d valides, %d invalides.
ja: 有効%d個、無効%d個
ko: 유효 %d개, 유효하지 않음 %d개
zh_hans: %d 个有效，%d 个无效。
zh_hant: %d 個有效，%d 個無效。

# cli.sidebar.unknownError
source: Unknown error
ar: خطأ غير معروف
de: Unbekannter Fehler
es: Error desconocido
fr: Erreur inconnue
ja: 不明なエラー
ko: 알 수 없는 오류
zh_hans: 未知错误
zh_hant: 未知錯誤

# cli.sidebar.usage
source: Usage: cmux sidebar <validate|reload|select|open> [name|--all] [--json] Validate, reload, select, or open custom sidebars from ~/.config/cmux/sidebars. Swift files win over JSON files with the same base name. Commands: validate [name] Validate all custom sidebars, or one named sidebar reload [name] Validate all sidebars, then reload every valid one select <name> Validate and activate one custom sidebar open <name> Open one custom sidebar as a Bonsplit pane Examples: cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree
ar: الاستخدام: cmux sidebar <validate|reload|select|open> [name|--all] [--json] التحقق من صحة الأشرطة الجانبية المخصصة من ~/.config/cmux/sidebars أو إعادة تحميلها أو تحديدها أو فتحها. تكون لملفات Swift الأولوية على ملفات JSON التي تحمل الاسم الأساسي نفسه. الأوامر: validate [name] التحقق من صحة جميع الأشرطة الجانبية المخصصة، أو شريط جانبي مسمى واحد reload [name] التحقق من صحة جميع الأشرطة الجانبية، ثم إعادة تحميل كل شريط صالح select <name> التحقق من صحة شريط جانبي مخصص واحد وتنشيطه open <name> فتح شريط جانبي مخصص واحد كجزء Bonsplit أمثلة: cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree
de: Verwendung: cmux sidebar <validate|reload|select|open> [name|--all] [--json] Benutzerdefinierte Seitenleisten aus ~/.config/cmux/sidebars validieren, neu laden, auswählen oder öffnen. Swift-Dateien haben Vorrang vor JSON-Dateien mit demselben Basisnamen. Befehle: validate [name] Alle benutzerdefinierten Seitenleisten oder eine benannte Seitenleiste validieren reload [name] Alle Seitenleisten validieren, dann jede gültige neu laden select <name> Eine benutzerdefinierte Seitenleiste validieren und aktivieren open <name> Eine benutzerdefinierte Seitenleiste als Bonsplit-Teilfenster öffnen Beispiele: cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree
es: Uso: cmux sidebar <validate|reload|select|open> [name|--all] [--json] Validar, recargar, seleccionar o abrir barras laterales personalizadas desde ~/.config/cmux/sidebars. Los archivos Swift tienen prioridad sobre los archivos JSON con el mismo nombre base. Comandos: validate [name] Validar todas las barras laterales personalizadas, o una barra lateral nombrada reload [name] Validar todas las barras laterales, luego recargar cada una que sea válida select <name> Validar y activar una barra lateral personalizada open <name> Abrir una barra lateral personalizada como un panel Bonsplit Ejemplos: cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree
fr: Usage: cmux sidebar <validate|reload|select|open> [name|--all] [--json] Valider, recharger, sélectionner ou ouvrir des barres latérales personnalisées depuis ~/.config/cmux/sidebars. Les fichiers Swift l'emportent sur les fichiers JSON ayant le même nom de base. Commandes: validate [name] Valider toutes les barres latérales personnalisées, ou une barre latérale nommée reload [name] Valider toutes les barres latérales, puis recharger chaque barre valide select <name> Valider et activer une barre latérale personnalisée open <name> Ouvrir une barre latérale personnalisée en tant que volet Bonsplit Exemples: cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree
ja: 使用法: cmux sidebar <validate|reload|select|open> [name|--all] [--json] ~/.config/cmux/sidebars のカスタムサイドバーを検証、再読み込み、選択、または開きます。 同じベース名の JSON ファイルより Swift ファイルが優先されます。 コマンド: validate [name] すべてのカスタムサイドバー、または指定したサイドバーを検証します reload [name] すべてのサイドバーを検証して、有効なものを再読み込みします select <name> 指定したカスタムサイドバーを検証して有効化します open <name> 指定したカスタムサイドバーを Bonsplit ペインとして開きます 例: cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree
ko: 사용법: cmux sidebar <validate|reload|select|open> [name|--all] [--json] ~/.config/cmux/sidebars에서 사용자 정의 사이드바를 검증, 재로드, 선택 또는 엽니다. 기본 이름이 같은 경우 Swift 파일이 JSON 파일보다 우선합니다. 명령어: validate [name] 모든 사용자 정의 사이드바 또는 지정된 이름의 사이드바를 검증합니다 reload [name] 모든 사이드바를 검증한 다음 유효한 모든 사이드바를 재로드합니다 select <name> 하나의 사용자 정의 사이드바를 검증하고 활성화합니다 open <name> 하나의 사용자 정의 사이드바를 Bonsplit 분할 창으로 엽니다 예시: cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree
zh_hans: 用法：cmux sidebar <validate|reload|select|open> [name|--all] [--json] 校验、重新加载、选择或打开 ~/.config/cmux/sidebars 中的自定义侧边栏。 同名情况下，Swift 文件优先于 JSON 文件。 命令: validate [name] 校验所有自定义侧边栏，或校验指定名称的一个 reload [name] 校验所有侧边栏，然后重新加载每一个有效的侧边栏 select <name> 校验并激活一个自定义侧边栏 open <name> 将一个自定义侧边栏作为 Bonsplit 窗格打开 示例: cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree
zh_hant: 用法：cmux sidebar <validate|reload|select|open> [name|--all] [--json] 驗證、重新載入、選取或開啟來自 ~/.config/cmux/sidebars 的自訂側邊欄。 具有相同主檔名的 Swift 檔案優先於 JSON 檔案。 指令： validate [name] 驗證所有自訂側邊欄，或一個指定的側邊欄 reload [name] 驗證所有側邊欄，然後重新載入每個有效的側邊欄 select <name> 驗證並啟用一個自訂側邊欄 open <name> 將一個自訂側邊欄開啟為 Bonsplit 窗格 範例： cmux sidebar validate cmux sidebar reload --all cmux sidebar select finder.tree cmux sidebar open finder.tree

# cli.simulator.error.accessibilityMissing
source: The Simulator worker returned no accessibility snapshot
ar: لم يرجع عامل Simulator أي لقطة لإمكانية الوصول
de: Der Simulator-Worker hat keinen Bedienungshilfen-Snapshot zurückgegeben
es: El trabajador del simulador no devolvió ninguna instantánea de accesibilidad
fr: Le worker du simulateur n'a renvoyé aucun instantané d'accessibilité
ja: Simulatorワーカーからアクセシビリティスナップショットが返されませんでした
ko: 시뮬레이터 워커가 접근성 스냅샷을 반환하지 않았습니다
zh_hans: 模拟器 worker 未返回辅助功能快照
zh_hant: 模擬器工作程序未傳回輔助使用快照

# cli.simulator.error.ambiguousSurface
source: Multiple Simulator surfaces were found; pass surface_id
ar: تم العثور على أسطح Simulator متعددة؛ يرجى تمرير surface_id
de: Es wurden mehrere Simulator-Oberflächen gefunden; übergeben Sie surface_id
es: Se encontraron múltiples superficies del simulador; pase surface_id
fr: Plusieurs surfaces d’affichage du simulateur ont été trouvées ; transmettez surface_id
ja: 複数のSimulatorサーフェスが見つかりました。surface_idを指定してください
ko: 여러 시뮬레이터 화면이 발견되었습니다. surface_id를 전달하세요
zh_hans: 找到多个模拟器表面；请传入 surface_id
zh_hant: 找到多個模擬器介面；請傳遞 surface_id

# cli.simulator.error.callerSurfaceUnavailable
source: The caller surface is no longer available. Pass --surface or --window to select a Simulator.
ar: سطح المستدعي لم يعد متاحًا. مرر --surface أو --window لتحديد Simulator.
de: Die aufrufende Oberfläche ist nicht mehr verfügbar. Übergeben Sie --surface oder --window, um einen Simulator auszuwählen.
es: La superficie de llamada ya no está disponible. Pase --surface o --window para seleccionar un simulador.
fr: La surface d’affichage appelante n'est plus disponible. Transmettez --surface ou --window pour sélectionner un simulateur.
ja: 呼び出し元のサーフェスは利用できなくなりました。--surface または --window でSimulatorを選択してください。
ko: 호출자 화면을 더 이상 사용할 수 없습니다. 시뮬레이터를 선택하려면 --surface 또는 --window를 전달하세요.
zh_hans: 调用方表面已不可用。请传入 --surface 或 --window 以选择模拟器。
zh_hant: 呼叫端介面已不再可用。請傳遞 --surface 或 --window 以選取模擬器。

# cli.simulator.error.cameraFailed
source: The Simulator camera operation failed
ar: فشلت عملية كاميرا Simulator
de: Die Simulator-Kamera-Aktion ist fehlgeschlagen
es: Falló la operación de la cámara del simulador
fr: L'opération de la caméra du simulateur a échoué
ja: Simulatorのカメラ操作に失敗しました
ko: 시뮬레이터 카메라 작업에 실패했습니다
zh_hans: 模拟器摄像头操作失败
zh_hant: 模擬器相機操作失敗

# cli.simulator.error.cameraPathRequired
source: Camera source %@ requires a file path
ar: يتطلب مصدر الكاميرا %@ مسار ملف
de: Kameraquelle „%@“ erfordert einen Dateipfad
es: La fuente de cámara %@ requiere una ruta de archivo
fr: La source de caméra %@ requiert un chemin de fichier
ja: カメラソース%@にはファイルパスが必要です
ko: 카메라 소스 %@에는 파일 경로가 필요합니다
zh_hans: 摄像头源 %@ 需要一个文件路径
zh_hant: 相機來源 %@ 需要檔案路徑

# cli.simulator.error.cameraStatusMissing
source: The Simulator worker returned no camera status
ar: لم يرجع عامل Simulator أي حالة للكاميرا
de: Der Simulator-Worker hat keinen Kamerastatus zurückgegeben
es: El worker del simulador no devolvió ningún estado de la cámara
fr: Le worker du simulateur n'a renvoyé aucun état de caméra
ja: Simulatorワーカーからカメラ状態が返されませんでした
ko: 시뮬레이터 워커가 카메라 상태를 반환하지 않았습니다
zh_hans: 模拟器 worker 未返回摄像头状态
zh_hant: 模擬器工作程序未傳回相機狀態

# cli.simulator.error.cameraUnreadable
source: The camera file is not a readable image or video
ar: ملف الكاميرا ليس صورة أو فيديو قابلًا للقراءة
de: Die Kameradatei ist kein lesbares Bild oder Video
es: El archivo de cámara no es una imagen o video legible
fr: Le fichier de caméra n'est pas une image ou une vidéo lisible
ja: カメラファイルを画像または動画として読み込めません
ko: 카메라 파일이 읽을 수 있는 이미지 또는 비디오가 아닙니다
zh_hans: 摄像头文件不是可读的图片或视频
zh_hant: 相機檔案不是可讀取的圖片或影片

# cli.simulator.error.capabilityUnavailable
source: The active Simulator worker does not support this operation
ar: عامل Simulator النشط لا يدعم هذه العملية
de: Der aktive Simulator-Worker unterstützt diese Aktion nicht
es: El worker activo del simulador no admite esta operación
fr: Le worker actif du simulateur ne prend pas en charge cette opération
ja: 現在のSimulatorワーカーはこの操作に対応していません
ko: 활성 시뮬레이터 워커가 이 작업을 지원하지 않습니다
zh_hans: 当前的模拟器 worker 不支持此操作
zh_hant: 執行中的模擬器工作程序不支援此操作

# cli.simulator.error.deviceRequired
source: The Simulator pane has no selected device
ar: لا يحتوي جزء Simulator على أي جهاز محدد
de: Das Simulator-Teilfenster hat kein ausgewähltes Gerät
es: El panel del simulador no tiene ningún dispositivo seleccionado
fr: Le volet du simulateur n'a aucun appareil sélectionné
ja: Simulatorペインでデバイスが選択されていません
ko: 시뮬레이터 분할 창에 선택된 기기가 없습니다
zh_hans: 该模拟器窗格未选择设备
zh_hant: 模擬器窗格未選取裝置

# cli.simulator.error.featureDisabled
source: Simulator has been disabled remotely
ar: تم تعطيل Simulator عن بُعد
de: Der Simulator wurde aus der Ferne deaktiviert
es: El simulador se ha desactivado de forma remota
fr: Le simulateur a été désactivé à distance
ja: Simulatorはリモートで無効化されています
ko: 시뮬레이터가 원격으로 비활성화되었습니다
zh_hans: 模拟器已被远程禁用
zh_hant: 模擬器已在遠端被停用

# cli.simulator.error.foregroundMissing
source: The Simulator worker returned no foreground-app result
ar: لم يرجع عامل Simulator أي نتيجة لتطبيق المقدمة
de: Der Simulator-Worker hat kein Ergebnis für die Vordergrund-App zurückgegeben
es: El worker del simulador no devolvió ningún resultado de la aplicación en primer plano
fr: Le worker du simulateur n'a renvoyé aucun résultat d'application au premier plan
ja: SimulatorワーカーからフォアグラウンドAppの結果が返されませんでした
ko: 시뮬레이터 워커가 포그라운드 앱 결과를 반환하지 않았습니다
zh_hans: 模拟器 worker 未返回前台应用结果
zh_hant: 模擬器工作程序未傳回前景應用程式結果

# cli.simulator.error.inputFailed
source: Simulator input transmission failed
ar: فشل إرسال إدخال Simulator
de: Die Übertragung der Simulator-Eingabe ist fehlgeschlagen
es: La transmisión de la entrada del simulador falló
fr: La transmission de la saisie du simulateur a échoué
ja: Simulator入力の送信に失敗しました
ko: 시뮬레이터 입력 전송에 실패했습니다
zh_hans: 模拟器输入传输失败
zh_hant: 模擬器輸入傳輸失敗

# cli.simulator.error.inputTimeout
source: Simulator input transmission did not complete before the deadline
ar: لم يكتمل إرسال إدخال Simulator قبل الموعد النهائي
de: Die Übertragung der Simulator-Eingabe wurde nicht vor dem Zeitlimit abgeschlossen
es: La transmisión de la entrada del simulador no se completó antes del tiempo límite
fr: La transmission de la saisie du simulateur ne s'est pas terminée dans le délai imparti
ja: 期限までにSimulator入力の送信が完了しませんでした
ko: 시뮬레이터 입력 전송이 제한 시간 내에 완료되지 않았습니다
zh_hans: 模拟器输入传输未在期限内完成
zh_hant: 模擬器輸入傳輸未在截止時間前完成

# cli.simulator.error.inputTooLarge
source: simulator input exceeds the %lld-byte UTF-8 limit
ar: تتجاوز مدخلات المحاكي حد الـ %lld بايت لترميز UTF-8
de: Simulatoreingabe überschreitet das %lld-Byte-UTF-8-Limit
es: la entrada del simulador supera el límite de %lld bytes UTF-8
fr: l'entrée du simulateur dépasse la limite UTF-8 de %lld octets
ja: シミュレーターの入力が%lldバイトのUTF-8制限を超えています
ko: 시뮬레이터 입력이 %lld바이트 UTF-8 제한을 초과함
zh_hans: 模拟器输入超出 %lld 字节的 UTF-8 限制
zh_hant: 模擬器輸入已超過 %lld 位元組的 UTF-8 限制

# cli.simulator.error.interfaceStatusMissing
source: The Simulator worker returned no interface status
ar: لم يرجع عامل Simulator أي حالة للواجهة
de: Der Simulator-Worker hat keinen Schnittstellenstatus zurückgegeben
es: El worker del simulador no devolvió ningún estado de la interfaz
fr: Le worker du simulateur n'a renvoyé aucun état d'interface
ja: Simulatorワーカーからインターフェース状態が返されませんでした
ko: 시뮬레이터 워커가 인터페이스 상태를 반환하지 않았습니다
zh_hans: 模拟器 worker 未返回界面状态
zh_hant: 模擬器工作程序未傳回介面狀態

# cli.simulator.error.invalidArguments
source: Invalid arguments for simulator %@
ar: وسيطات غير صالحة لـ simulator %@
de: Ungültige Argumente für Simulator „%@“
es: Argumentos no válidos para el simulador %@
fr: Arguments invalides pour le simulateur %@
ja: simulator %@ の引数が無効です
ko: 시뮬레이터 %@에 대한 인수가 올바르지 않습니다
zh_hans: simulator %@ 的参数无效
zh_hant: 模擬器 %@ 的引數無效

# cli.simulator.error.invalidBundleIdentifier
source: Invalid Simulator application bundle identifier: %@
ar: معرف حزمة تطبيق Simulator غير صالح: %@
de: Ungültige Bundle-ID der Simulator-Anwendung: %@
es: Identificador de paquete (bundle identifier) de la aplicación del simulador no válido: %@
fr: Identifiant de bundle d'application du simulateur invalide : %@
ja: Simulatorアプリのバンドル識別子が無効です: %@
ko: 올바르지 않은 시뮬레이터 애플리케이션 번들 식별자: %@
zh_hans: 无效的模拟器应用 bundle identifier：%@
zh_hant: 無效的模擬器應用程式套件識別碼：%@

# cli.simulator.error.invalidCoordinate
source: Simulator coordinates must be numbers from 0 through 1
ar: يجب أن تكون إحداثيات Simulator أرقامًا من 0 إلى 1
de: Simulator-Koordinaten müssen Zahlen von 0 bis 1 sein
es: Las coordenadas del simulador deben ser números de 0 a 1
fr: Les coordonnées du simulateur doivent être des nombres compris entre 0 et 1
ja: Simulator座標は0から1までの数値で指定してください
ko: 시뮬레이터 좌표는 0에서 1 사이의 숫자여야 합니다
zh_hans: 模拟器坐标必须是 0 到 1 之间的数字
zh_hant: 模擬器座標必須是介於 0 到 1 之間的數字

# cli.simulator.error.invalidGestureJSON
source: simulator gesture requires a JSON touch object or array
ar: تتطلب إيماءة simulator كائن لمس أو مصفوفة بتنسيق JSON
de: Simulator-Geste erfordert ein JSON-Touch-Objekt oder -Array
es: el gesto del simulador requiere un objeto o matriz JSON de toque
fr: le geste du simulateur requiert un objet ou tableau JSON touch
ja: simulator gesture にはJSONタッチオブジェクトまたは配列が必要です
ko: simulator gesture에는 JSON 터치 객체 또는 배열이 필요합니다
zh_hans: simulator gesture 需要一个 JSON 触摸对象或数组
zh_hant: simulator gesture 需要 JSON 觸控物件或陣列

# cli.simulator.error.invalidHighlight
source: simulator highlight requires on or off
ar: يتطلب تمييز simulator القيمة on أو off
de: Simulator-Hervorhebung erfordert on oder off
es: el resaltado del simulador requiere on u off
fr: la mise en surbrillance du simulateur requiert on ou off
ja: simulator highlight には on または off が必要です
ko: simulator highlight에는 on 또는 off가 필요합니다
zh_hans: simulator highlight 需要 on 或 off
zh_hant: simulator highlight 需要為 on 或 off

# cli.simulator.error.invalidMirrorMode
source: Camera mirror mode must be auto, on, or off
ar: يجب أن يكون وضع انعكاس الكاميرا auto أو on أو off
de: Kameraspiegelungsmodus muss auto, on oder off sein
es: El modo espejo de la cámara debe ser auto, on u off
fr: Le mode miroir de la caméra doit être auto, on ou off
ja: カメラのミラーモードはauto、on、offのいずれかで指定してください
ko: 카메라 미러 모드는 auto, on 또는 off여야 합니다
zh_hans: 摄像头镜像模式必须为 auto、on 或 off
zh_hant: 相機鏡像模式必須是 auto、on 或 off

# cli.simulator.error.invalidParameters
source: Invalid Simulator parameters
ar: معلمات Simulator غير صالحة
de: Ungültige Simulator-Parameter
es: Parámetros del simulador no válidos
fr: Paramètres du simulateur invalides
ja: Simulatorのパラメータが無効です
ko: 시뮬레이터 매개변수가 올바르지 않습니다
zh_hans: 无效的模拟器参数
zh_hant: 模擬器參數無效

# cli.simulator.error.invalidPermission
source: The Simulator permission action or service is invalid
ar: إجراء أو خدمة إذن Simulator غير صالحة
de: Die Berechtigungsaktion oder der Berechtigungsdienst des Simulators ist ungültig
es: La acción o servicio de permisos del simulador no es válida
fr: L'action ou le service d'autorisation du simulateur est invalide
ja: Simulatorの権限操作またはサービスが無効です
ko: 시뮬레이터 권한 작업 또는 서비스가 올바르지 않습니다
zh_hans: 模拟器权限操作或服务无效
zh_hant: 模擬器權限動作或服務無效

# cli.simulator.error.invalidPermissionValue
source: Invalid value '%@' for Simulator permission %@
ar: قيمة غير صالحة '%@' لإذن Simulator ‏%@
de: Ungültiger Wert „%@“ für Simulator-Berechtigung %@
es: Valor no válido '%@' para el permiso de simulador %@
fr: Valeur invalide '%@' pour la permission du simulateur %@
ja: 値'%@'はSimulator権限%@では無効です
ko: 값 '%@'은(는) Simulator 권한 %@에 유효하지 않습니다.
zh_hans: '%@' 不是模拟器权限 %@ 的有效值
zh_hant: 值 '%@' 對於模擬器權限 %@ 而言無效

# cli.simulator.error.invalidToolsAction
source: Simulator tools action must be show, hide, or toggle
ar: يجب أن يكون إجراء أدوات Simulator هو show أو hide أو toggle
de: Aktion für die Simulator-Tools muss show, hide oder toggle sein
es: La acción de las herramientas del simulador debe ser show, hide o toggle
fr: L'action des outils du simulateur doit être show, hide ou toggle
ja: Simulatorツールの操作には show、hide、toggle のいずれかを指定してください
ko: 시뮬레이터 도구 작업은 show, hide 또는 toggle이어야 합니다
zh_hans: 模拟器 tools 操作必须为 show、hide 或 toggle
zh_hant: 模擬器工具動作必須為 show、hide 或 toggle

# cli.simulator.error.invalidUISetting
source: The Simulator interface option or value is invalid
ar: خيار أو قيمة واجهة Simulator غير صالحة
de: Die Simulator-Schnittstellenoption oder der Wert ist ungültig
es: La opción o valor de interfaz del simulador no es válido
fr: L'option ou la valeur d'interface du simulateur est invalide
ja: Simulatorのインターフェース項目または値が無効です
ko: 시뮬레이터 인터페이스 옵션 또는 값이 올바르지 않습니다
zh_hans: 模拟器界面选项或值无效
zh_hant: 模擬器介面選項或值無效

# cli.simulator.error.invalidUIValue
source: Invalid value '%@' for Simulator interface option %@
ar: قيمة غير صالحة '%@' لخيار واجهة Simulator ‏%@
de: Ungültiger Wert „%@“ für Simulator-Schnittstellenoption %@
es: Valor no válido '%@' para la opción de interfaz del simulador %@
fr: Valeur invalide '%@' pour l'option d'interface du simulateur %@
ja: 値'%@'はSimulatorインターフェース項目%@では無効です
ko: 유효하지 않은 값 '%@' (시뮬레이터 인터페이스 옵션: %@)
zh_hans: '%@' 不是模拟器界面选项 %@ 的有效值
zh_hant: 值 '%@' 對於模擬器介面選項 %@ 而言無效

# cli.simulator.error.invalidUTF8
source: simulator input must be valid UTF-8
ar: يجب أن يكون إدخال simulator بتنسيق UTF-8 صالح
de: Simulator-Eingabe muss gültiges UTF-8 sein
es: la entrada del simulador debe ser UTF-8 válida
fr: la saisie du simulateur doit être en UTF-8 valide
ja: Simulator入力は有効なUTF-8である必要があります
ko: simulator input은 유효한 UTF-8이어야 합니다
zh_hans: simulator input 必须是有效的 UTF-8
zh_hant: simulator input 必須為有效的 UTF-8

# cli.simulator.error.keyboardUnavailable
source: Simulator keyboard input is unavailable
ar: إدخال لوحة مفاتيح Simulator غير متاح
de: Simulator-Tastatureingabe ist nicht verfügbar
es: La entrada de teclado del simulador no está disponible
fr: La saisie au clavier du simulateur est indisponible
ja: Simulatorのキーボード入力を使用できません
ko: 시뮬레이터 키보드 입력을 사용할 수 없습니다
zh_hans: 模拟器键盘输入不可用
zh_hant: 模擬器鍵盤輸入無法使用

# cli.simulator.error.missingOptionValue
source: simulator: %@ requires a value
ar: simulator: يتطلب %@ قيمة
de: simulator: %@ erfordert einen Wert
es: simulator: %@ requiere un valor
fr: simulator : %@ requiert une valeur
ja: simulator: %@ には値が必要です
ko: simulator: %@에 값이 필요합니다
zh_hans: simulator：%@ 需要一个值
zh_hant: simulator: %@ 需要一個值

# cli.simulator.error.noActiveWindow
source: No active cmux window
ar: لا توجد نافذة cmux نشطة
de: Kein aktives cmux-Fenster
es: No hay ninguna ventana de cmux activa
fr: Aucune fenêtre cmux active
ja: アクティブなcmuxウィンドウがありません
ko: 활성화된 cmux 창이 없습니다
zh_hans: 没有活动的 cmux 窗口
zh_hant: 沒有使用中的 cmux 視窗

# cli.simulator.error.noSelectedDevice
source: The Simulator pane has no selected device
ar: لا يحتوي جزء Simulator على أي جهاز محدد
de: Das Simulator-Teilfenster hat kein ausgewähltes Gerät
es: El panel del simulador no tiene ningún dispositivo seleccionado
fr: Le volet du simulateur n'a aucun appareil sélectionné
ja: Simulatorペインでデバイスが選択されていません
ko: 시뮬레이터 분할 창에 선택된 기기가 없습니다
zh_hans: 该模拟器窗格未选择设备
zh_hant: 模擬器窗格未選取裝置

# cli.simulator.error.notStreaming
source: The selected Simulator is not streaming
ar: إن Simulator المحدد لا يقوم بالبث حاليًا
de: Der ausgewählte Simulator streamt nicht
es: El simulador seleccionado no está transmitiendo
fr: Le simulateur sélectionné ne diffuse pas
ja: 選択したSimulatorはストリーミング中ではありません
ko: 선택한 시뮬레이터가 스트리밍 중이 아닙니다
zh_hans: 所选模拟器未在串流
zh_hant: 選取的模擬器未在進行串流
